final List<BenefitsOfBlood> BenefitBlood = [
  BenefitsOfBlood(
    title: '۱. نجات زندگی',
    details:
        'اهدای خون می‌تواند زندگی افرادی را که به دلایل مختلفی به خون نیاز دارند، نجات دهد. ممکن است افراد مبتلا به بیماری‌های خونی، تصادفات جدی، عمل جراحی پیچیده یا زایمان مشکل‌دار به خون نیاز داشته باشند. اهدای خون به این افراد کمک می‌کند تا بهبود یابند و زندگی خود را ادامه دهند.',
  ),
  BenefitsOfBlood(
    title: '۲. پیشگیری از هموکروماتوز',
    details:
        'اهدای خون می تواند خطر ابتلا به هموکروماتوز را کاهش دهد و یا از ابتلا به این بیماری جلوگیری کند؛ هموکروماتوز، وضعیتی است که بر اثر ابتلا به آن جذب آهن بیش از حد توسط بدن صورت می گیرد. اهدای منظم خون ممکن است باعث کاهش اضافه بار آهن در خون شود ، از این رو اهدای خون برای افراد مبتلا به هموکروماتوز مفید است.با این حال ، اطمینان از رعایت استانداردهای اجباری معیارهای صلاحیت اهدای خون، توسط اهدا کننده مبتلا به هموکروماتوز ضروری است.',
  ),
  BenefitsOfBlood(
    title: '۳. کاهش خطر ابتلا به بیماری‌های قلبی',
    details:
        ' اهدای منظم خون با کنترل سطح آهن، خطر ابتلا به بیماری های قلبی را کاهش می دهد. تجمع زیاد آهن در بدن می تواند باعث آسیب اکسیداتیو شود که ثابت شده عامل اصلی تسریع پیری، سکته های قلبی ، مغزی و غیره است.',
  ),
  BenefitsOfBlood(
    title: '۴. کاهش خطر ابتلا به سرطان',
    details:
        'وجود سطح بالای آهن در بدن، در واقع پیش زمینه ای برای ابتلا به سرطان است. با اهدای خون می توان سطح سالم آهن را در بدن  حفظ کرد و در نتیجه خطر ابتلا به سرطان را کاهش داد.',
  ),
  BenefitsOfBlood(
    title: '۵. تقویت تولید سلول‌های جدید خونی',
    details:
        'اهدای خون موجب تحریک تولید سلول های جدید خونی می شود. بطوریکه پس از اهدای خون، بدن طی ۴۸ ساعت با کمک مغز استخوان فعالیت می کند تا میزان خون اهدا شده را جبران کند. گلبول های جدید خونی تولید می شود و تمام گلبول های قرمز از دست رفته در مدت زمان ۳۰ تا ۶۰ روز جایگزین می شوند. از این رو ، اهدای خون به حفظ سلامتی انسان کمک می کند.',
  ),
];

class BenefitsOfBlood {
  final String title;
  final String details;

  BenefitsOfBlood({required this.title, required this.details});
}

final List<QualificationOfBlood> qualification = [
  QualificationOfBlood(
    title: '۱. سن',
    details:
        'برخی سازمان‌ها شرایط سنی را برای اهدای خون تعیین می‌کنند. به طور معمول، اهداکنندگان باید بین 18 تا 65 سال (ممکن است در برخی موارد حداکثر سن تا 70 سال) باشند. این محدودیت سنی به دلیل حفظ سلامت و عملکرد بهتر سیستم بدن در تولید و بازسازی خون است.',
  ),
  QualificationOfBlood(
    title: '۲. وضعیت سلامتی',
    details:
        'اهداکنندگان باید در وضعیت سلامتی خوب باشند و به هیچ بیماری عفونی مبتلا نباشند. علاوه بر این، برخی بیماری‌ها و شرایط مانند هموفیلی، سرطان، بیماری قلبی، دیابت و عفونت‌های خاص می‌تواند به موقت یا دائمی منجر به عدم اهلیت برای اهدای خون شود.',
  ),
  QualificationOfBlood(
    title: '۳. وزن',
    details:
        'اهداکنندگان باید وزن کافی داشته باشند تا به تولید کمیت کافی خون برای استفاده در درمان نیازمندان بپردازند. وزن حداقل مورد نیاز ممکن است در هر جایی متفاوت باشد، اما به طور عمومی شایستگی وزن بین ۵۰ تا ۱۱۰ کیلوگرم است.',
  ),
  QualificationOfBlood(
    title: '۴. فاصله تعداد دفعات اهدای خون',
    details:
        'بصورت کامل باید ۸ هفته یعنی ۵۶ روز باشد. اما از شروط اهدا این است که تعداد دفعات اهدای خون در طی یکسال از ۳ بار برای بانوان و ۴ بار برای آقایان بیشتر نشود. آقایان می توانند با فاصله زمانی 3 ماهه و بانوان با فاصله زمانی ۴ ماهه خون اهدا نمایند.',
  ),
  QualificationOfBlood(
    title: '۵. انتقال عفونت',
    details:
        'ایدز و هپاتیت دو از بیماری‌هایی هستند که به واسطه خون قابل انتقال هستند. اگر شخصی که به ایدز یا هپاتیت مبتلا است، خون خود را اهدا کند، ممکن است باعث انتقال ویروس به گیرنده خون شود. این موضوع ریسک بالایی برای سلامتی گیرنده خون ایجاد می‌کند.',
  ),
];

class QualificationOfBlood {
  final String title;
  final String details;

  QualificationOfBlood({required this.title, required this.details});
}

List<String> bloodGroupList = [
  '+ A',
  '- A',
  '+ B',
  '- B',
  '+ AB',
  '- AB',
  '+ O',
  '- O'
];

final List<String> cityList = ['هرات', 'کابل', 'مزار', 'لوگر'];
